
aurora -b -a 3 -c -T -Y3 -l4 -d0 -e /dev/ttyUSB0 

szttyDevice: /dev/ttyUSB0
yDelay:     4
yTimeout    0 mS
yMaxRunTime ~
devLCKfile: </var/lock/LCK..ttyUSB0>
devLCKfileNew: </var/lock/LCK..ttyUSB0.20000>
Got Params

RunTime     20200225-09:27:22 v1.9.3 
Endian    : Little
tm_gmtoff : yes
PID       : 20000

Attempting to get lock on Serial Port /dev/ttyUSB0...
Checking for lock
PID: 20000 COMMAND: "aurora" LckPID: 20000 LckCOMMAND: "aurora" LckPIDcommand "aurora" = me
Appears we got the lock.

Opening Serial Port /dev/ttyUSB0...  Serial Port /dev/ttyUSB0 successfully opened.
Configuring serial device... Flushing unread data first...  Success!
Flushing serial device buffer... Success!

Comm Check: Let's see if the Aurora is listening... 
Elapsed time since last comm 0 us
Attempt 1
Clearing read buffer Success!
szSerBufferSave OK! 03 3a 00 00 00 00 00 00 00 00 
command: 03 3a 00 00 00 00 00 00 be 36 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=0 (00) waited/max   408015/4000000  uS 
answer:  Got -1 characters

Elapsed time since last comm 0 us
Attempt 2
Clearing read buffer Success!
szSerBufferSave OK! 03 3a 00 00 00 00 00 00 00 00 
command: 03 3a 00 00 00 00 00 00 be 36 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=0 (00) 
answer:  Got -1 characters

Elapsed time since last comm 0 us
Attempt 3
Clearing read buffer Success!
szSerBufferSave OK! 03 3a 00 00 00 00 00 00 00 00 
command: 03 3a 00 00 00 00 00 00 be 36 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=1 (00) waited/max     2192/4000000  uS 
Read char #2 RC=1 (06) waited/max        8/4000000  uS 
Read char #3 RC=1 (33) waited/max        7/4000000  uS 
Read char #4 RC=1 (55) waited/max        7/4000000  uS 
Read char #5 RC=1 (4e) waited/max        6/4000000  uS 
Read char #6 RC=1 (4e) waited/max        7/4000000  uS 
Read char #7 RC=1 (7a) waited/max        7/4000000  uS 
Read char #8 RC=1 (68) waited/max        6/4000000  uS 
answer:  00 06 33 55 4e 4e 7a 68 
received 8 characters
CRC receive OK 687a
Transmission State Check: 0
Model ID "3" qMultiplier -1.0000000 -- PVI-3.6-OUTD --
Comm Check: OK

Elapsed time since last comm 230 us
Attempt 1
Clearing read buffer Success!
szSerBufferSave OK! 03 3b 04 00 00 00 00 00 00 00 
command: 03 3b 04 00 00 00 00 00 c7 b9 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=0 (00) waited/max   407407/4000000  uS 
answer:  Got -1 characters

Elapsed time since last comm 0 us
Attempt 2
Clearing read buffer Success!
szSerBufferSave OK! 03 3b 04 00 00 00 00 00 00 00 
command: 03 3b 04 00 00 00 00 00 c7 b9 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=0 (00) waited/max   407868/4000000  uS 
answer:  Got -1 characters

Elapsed time since last comm 0 us
Attempt 3
Clearing read buffer Success!
szSerBufferSave OK! 03 3b 04 00 00 00 00 00 00 00 
command: 03 3b 04 00 00 00 00 00 c7 b9 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=1 (00) waited/max    17426/4000000  uS 
Read char #2 RC=1 (06) waited/max        8/4000000  uS 
Read char #3 RC=1 (42) waited/max        7/4000000  uS 
Read char #4 RC=1 (48) waited/max    15730/4000000  uS 
Read char #5 RC=1 (06) waited/max        8/4000000  uS 
Read char #6 RC=1 (25) waited/max        7/4000000  uS 
Read char #7 RC=1 (1d) waited/max        7/4000000  uS 
Read char #8 RC=1 (01) waited/max        7/4000000  uS 
answer:  00 06 42 48 06 25 1d 01 
received 8 characters
CRC receive OK 011d
Transmission State Check: 0
szCvrtFloat    50.006001 0x42480625
value        50.006001

Elapsed time since last comm 83 us
Attempt 1
Clearing read buffer Success!
szSerBufferSave OK! 03 3b 01 00 00 00 00 00 00 00 
command: 03 3b 01 00 00 00 00 00 40 ad 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=0 (00) waited/max   408752/4000000  uS 
answer:  Got -1 characters

Elapsed time since last comm 0 us
Attempt 2
Clearing read buffer Success!
szSerBufferSave OK! 03 3b 01 00 00 00 00 00 00 00 
command: 03 3b 01 00 00 00 00 00 40 ad 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=1 (00) waited/max      310/4000000  uS 
Read char #2 RC=1 (06) waited/max        7/4000000  uS 
Read char #3 RC=1 (43) waited/max        7/4000000  uS 
Read char #4 RC=1 (74) waited/max        6/4000000  uS 
Read char #5 RC=1 (eb) waited/max        7/4000000  uS 
Read char #6 RC=1 (9c) waited/max        7/4000000  uS 
Read char #7 RC=1 (00) waited/max        6/4000000  uS 
Read char #8 RC=1 (4f) waited/max        6/4000000  uS 
answer:  00 06 43 74 eb 9c 00 4f 
received 8 characters
CRC receive OK 4f00
Transmission State Check: 0
szCvrtFloat   244.920349 0x4374eb9c
value       244.920349

Elapsed time since last comm 82 us
Attempt 1
Clearing read buffer Success!
szSerBufferSave OK! 03 3b 02 00 00 00 00 00 00 00 
command: 03 3b 02 00 00 00 00 00 3d a1 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=0 (00) waited/max   407761/4000000  uS 
answer:  Got -1 characters

Elapsed time since last comm 0 us
Attempt 2
Clearing read buffer Success!
szSerBufferSave OK! 03 3b 02 00 00 00 00 00 00 00 
command: 03 3b 02 00 00 00 00 00 3d a1 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=0 (00) 
answer:  Got -1 characters

Elapsed time since last comm 0 us
Attempt 3
Clearing read buffer Success!
szSerBufferSave OK! 03 3b 02 00 00 00 00 00 00 00 
command: 03 3b 02 00 00 00 00 00 3d a1 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=1 (00) waited/max    17521/4000000  uS 
Read char #2 RC=1 (06) waited/max        7/4000000  uS 
Read char #3 RC=1 (3f) waited/max        7/4000000  uS 
Read char #4 RC=1 (90) waited/max        7/4000000  uS 
Read char #5 RC=1 (3e) waited/max        6/4000000  uS 
Read char #6 RC=1 (55) waited/max        7/4000000  uS 
Read char #7 RC=1 (ff) waited/max        7/4000000  uS 
Read char #8 RC=1 (92) waited/max        7/4000000  uS 
answer:  00 06 3f 90 3e 55 ff 92 
received 8 characters
CRC receive OK 92ff
Transmission State Check: 0
szCvrtFloat     1.126902 0x3f903e55
value         1.126902

Elapsed time since last comm 74 us
Attempt 1
Clearing read buffer Success!
szSerBufferSave OK! 03 3b 03 00 00 00 00 00 00 00 
command: 03 3b 03 00 00 00 00 00 16 a5 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=0 (00) waited/max   404429/4000000  uS 
answer:  Got -1 characters

Elapsed time since last comm 0 us
Attempt 2
Clearing read buffer Success!
szSerBufferSave OK! 03 3b 03 00 00 00 00 00 00 00 
command: 03 3b 03 00 00 00 00 00 16 a5 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=0 (00) 
answer:  Got -1 characters

Elapsed time since last comm 0 us
Attempt 3
Clearing read buffer Success!
szSerBufferSave OK! 03 3b 03 00 00 00 00 00 00 00 
command: 03 3b 03 00 00 00 00 00 16 a5 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=1 (00) waited/max    12742/4000000  uS 
Read char #2 RC=1 (06) waited/max        7/4000000  uS 
Read char #3 RC=1 (43) waited/max        6/4000000  uS 
Read char #4 RC=1 (85) waited/max        7/4000000  uS 
Read char #5 RC=1 (4d) waited/max        7/4000000  uS 
Read char #6 RC=1 (b5) waited/max        6/4000000  uS 
Read char #7 RC=1 (04) waited/max        7/4000000  uS 
Read char #8 RC=1 (de) waited/max    15417/4000000  uS 
answer:  00 06 43 85 4d b5 04 de 
received 8 characters
CRC receive OK de04
Transmission State Check: 0
szCvrtFloat   266.607086 0x43854db5
value       266.607086

Elapsed time since last comm 84 us
Attempt 1
Clearing read buffer Success!
szSerBufferSave OK! 03 3b 17 00 00 00 00 00 00 00 
command: 03 3b 17 00 00 00 00 00 0a f7 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=0 (00) waited/max   408524/4000000  uS 
answer:  Got -1 characters

Elapsed time since last comm 0 us
Attempt 2
Clearing read buffer Success!
szSerBufferSave OK! 03 3b 17 00 00 00 00 00 00 00 
command: 03 3b 17 00 00 00 00 00 0a f7 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=0 (00) 
answer:  Got -1 characters

Elapsed time since last comm 0 us
Attempt 3
Clearing read buffer Success!
szSerBufferSave OK! 03 3b 17 00 00 00 00 00 00 00 
command: 03 3b 17 00 00 00 00 00 0a f7 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=1 (00) waited/max    13948/4000000  uS 
Read char #2 RC=1 (06) waited/max        8/4000000  uS 
Read char #3 RC=1 (43) waited/max        7/4000000  uS 
Read char #4 RC=1 (c7) waited/max        7/4000000  uS 
Read char #5 RC=1 (a9) waited/max        6/4000000  uS 
Read char #6 RC=1 (79) waited/max        6/4000000  uS 
Read char #7 RC=1 (53) waited/max        7/4000000  uS 
Read char #8 RC=1 (ef) waited/max        6/4000000  uS 
answer:  00 06 43 c7 a9 79 53 ef 
received 8 characters
CRC receive OK ef53
Transmission State Check: 0
szCvrtFloat   399.324005 0x43c7a979
value       399.324005

Elapsed time since last comm 83 us
Attempt 1
Clearing read buffer Success!
szSerBufferSave OK! 03 3b 19 00 00 00 00 00 00 00 
command: 03 3b 19 00 00 00 00 00 a8 ce 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=1 (00) waited/max      437/4000000  uS 
Read char #2 RC=1 (06) waited/max        7/4000000  uS 
Read char #3 RC=1 (3e) waited/max        7/4000000  uS 
Read char #4 RC=1 (c3) waited/max        6/4000000  uS 
Read char #5 RC=1 (ec) waited/max        6/4000000  uS 
Read char #6 RC=1 (03) waited/max        7/4000000  uS 
Read char #7 RC=1 (fb) waited/max        6/4000000  uS 
Read char #8 RC=1 (b9) waited/max        6/4000000  uS 
answer:  00 06 3e c3 ec 03 fb b9 
received 8 characters
CRC receive OK b9fb
Transmission State Check: 0
szCvrtFloat     0.382660 0x3ec3ec03
value         0.382660

Elapsed time since last comm 70 us
Attempt 1
Clearing read buffer Success!
szSerBufferSave OK! 03 3b 1a 00 00 00 00 00 00 00 
command: 03 3b 1a 00 00 00 00 00 d5 c2 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=0 (00) waited/max   408370/4000000  uS 
answer:  Got -1 characters

Elapsed time since last comm 0 us
Attempt 2
Clearing read buffer Success!
szSerBufferSave OK! 03 3b 1a 00 00 00 00 00 00 00 
command: 03 3b 1a 00 00 00 00 00 d5 c2 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=0 (00) 
answer:  Got -1 characters

Elapsed time since last comm 0 us
Attempt 3
Clearing read buffer Success!
szSerBufferSave OK! 03 3b 1a 00 00 00 00 00 00 00 
command: 03 3b 1a 00 00 00 00 00 d5 c2 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=0 (00) waited/max   407309/4000000  uS 
answer:  Got -1 characters
_ERROR_ (59 26)

Restoring Serial Port settings /dev/ttyUSB0... Success!
Flushing serial device buffer... Success!
Closing Serial Port /dev/ttyUSB0... Success!

devLCKfile: </var/lock/LCK..ttyUSB0>
devLCKfileNew: </var/lock/LCK..ttyUSB0.20000>
Clearing Serial Port Lock (20000)... done.

20200225-09:27:28: aurora: ERROR: Received bad return code (-1 59 26)

Complete 20200225-09:27:28

