
aurora -b -a 3 -c -T -Y3 -l4 -d0 -e /dev/ttyUSB0 

szttyDevice: /dev/ttyUSB0
yDelay:     4
yTimeout    0 mS
yMaxRunTime ~
devLCKfile: </var/lock/LCK..ttyUSB0>
devLCKfileNew: </var/lock/LCK..ttyUSB0.20094>
Got Params

RunTime     20200225-09:29:02 v1.9.3 
Endian    : Little
tm_gmtoff : yes
PID       : 20094

Attempting to get lock on Serial Port /dev/ttyUSB0...
Checking for lock
PID: 20094 COMMAND: "aurora" LckPID: 20094 LckCOMMAND: "aurora" LckPIDcommand "aurora" = me
Appears we got the lock.

Opening Serial Port /dev/ttyUSB0...  Serial Port /dev/ttyUSB0 successfully opened.
Configuring serial device... Flushing unread data first...  Success!
Flushing serial device buffer... Success!

Comm Check: Let's see if the Aurora is listening... 
Elapsed time since last comm 0 us
Attempt 1
Clearing read buffer Success!
szSerBufferSave OK! 03 3a 00 00 00 00 00 00 00 00 
command: 03 3a 00 00 00 00 00 00 be 36 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=0 (00) waited/max   408169/4000000  uS 
answer:  Got -1 characters

Elapsed time since last comm 0 us
Attempt 2
Clearing read buffer Success!
szSerBufferSave OK! 03 3a 00 00 00 00 00 00 00 00 
command: 03 3a 00 00 00 00 00 00 be 36 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=0 (00) 
answer:  Got -1 characters

Elapsed time since last comm 0 us
Attempt 3
Clearing read buffer Success!
szSerBufferSave OK! 03 3a 00 00 00 00 00 00 00 00 
command: 03 3a 00 00 00 00 00 00 be 36 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=1 (00) waited/max      547/4000000  uS 
Read char #2 RC=1 (06) waited/max        7/4000000  uS 
Read char #3 RC=1 (33) waited/max        8/4000000  uS 
Read char #4 RC=1 (55) waited/max        7/4000000  uS 
Read char #5 RC=1 (4e) waited/max        7/4000000  uS 
Read char #6 RC=1 (4e) waited/max        7/4000000  uS 
Read char #7 RC=1 (7a) waited/max        7/4000000  uS 
Read char #8 RC=1 (68) waited/max        7/4000000  uS 
answer:  00 06 33 55 4e 4e 7a 68 
received 8 characters
CRC receive OK 687a
Transmission State Check: 0
Model ID "3" qMultiplier -1.0000000 -- PVI-3.6-OUTD --
Comm Check: OK

Elapsed time since last comm 215 us
Attempt 1
Clearing read buffer Success!
szSerBufferSave OK! 03 3b 04 00 00 00 00 00 00 00 
command: 03 3b 04 00 00 00 00 00 c7 b9 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=0 (00) waited/max   407476/4000000  uS 
answer:  Got -1 characters

Elapsed time since last comm 0 us
Attempt 2
Clearing read buffer Success!
szSerBufferSave OK! 03 3b 04 00 00 00 00 00 00 00 
command: 03 3b 04 00 00 00 00 00 c7 b9 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=0 (00) waited/max   407902/4000000  uS 
answer:  Got -1 characters

Elapsed time since last comm 0 us
Attempt 3
Clearing read buffer Success!
szSerBufferSave OK! 03 3b 04 00 00 00 00 00 00 00 
command: 03 3b 04 00 00 00 00 00 c7 b9 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=1 (00) 
Read char #2 RC=1 (06) waited/max        7/4000000  uS 
Read char #3 RC=1 (42) waited/max        7/4000000  uS 
Read char #4 RC=1 (48) waited/max        7/4000000  uS 
Read char #5 RC=1 (11) waited/max        7/4000000  uS 
Read char #6 RC=1 (6a) waited/max        7/4000000  uS 
Read char #7 RC=1 (77) waited/max        7/4000000  uS 
Read char #8 RC=1 (63) waited/max        7/4000000  uS 
answer:  00 06 42 48 11 6a 77 63 
received 8 characters
CRC receive OK 6377
Transmission State Check: 0
szCvrtFloat    50.017006 0x4248116a
value        50.017006

Elapsed time since last comm 83 us
Attempt 1
Clearing read buffer Success!
szSerBufferSave OK! 03 3b 01 00 00 00 00 00 00 00 
command: 03 3b 01 00 00 00 00 00 40 ad 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=0 (00) waited/max   408830/4000000  uS 
answer:  Got -1 characters

Elapsed time since last comm 0 us
Attempt 2
Clearing read buffer Success!
szSerBufferSave OK! 03 3b 01 00 00 00 00 00 00 00 
command: 03 3b 01 00 00 00 00 00 40 ad 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=1 (db) waited/max     8615/4000000  uS 
Read char #2 RC=1 (fa) waited/max        7/4000000  uS 
Read char #3 RC=0 (00) waited/max   408498/4000000  uS 
answer:  Got -1 characters

Elapsed time since last comm 0 us
Attempt 3
Clearing read buffer Success!
szSerBufferSave OK! 03 3b 01 00 00 00 00 00 00 00 
command: 03 3b 01 00 00 00 00 00 40 ad 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=1 (00) waited/max    16998/4000000  uS 
Read char #2 RC=1 (06) waited/max        8/4000000  uS 
Read char #3 RC=1 (43) waited/max        7/4000000  uS 
Read char #4 RC=1 (75) waited/max        7/4000000  uS 
Read char #5 RC=1 (10) waited/max        7/4000000  uS 
Read char #6 RC=1 (a8) waited/max        7/4000000  uS 
Read char #7 RC=1 (db) waited/max        7/4000000  uS 
Read char #8 RC=1 (fa) waited/max        7/4000000  uS 
answer:  00 06 43 75 10 a8 db fa 
received 8 characters
CRC receive OK fadb
Transmission State Check: 0
szCvrtFloat   245.065063 0x437510a8
value       245.065063

Elapsed time since last comm 79 us
Attempt 1
Clearing read buffer Success!
szSerBufferSave OK! 03 3b 02 00 00 00 00 00 00 00 
command: 03 3b 02 00 00 00 00 00 3d a1 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=0 (00) 
answer:  Got -1 characters

Elapsed time since last comm 0 us
Attempt 2
Clearing read buffer Success!
szSerBufferSave OK! 03 3b 02 00 00 00 00 00 00 00 
command: 03 3b 02 00 00 00 00 00 3d a1 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=1 (00) waited/max    11844/4000000  uS 
Read char #2 RC=1 (06) waited/max        7/4000000  uS 
Read char #3 RC=1 (3f) waited/max    15826/4000000  uS 
Read char #4 RC=1 (9c) waited/max        8/4000000  uS 
Read char #5 RC=1 (85) waited/max        7/4000000  uS 
Read char #6 RC=1 (a1) waited/max        7/4000000  uS 
Read char #7 RC=1 (31) waited/max        7/4000000  uS 
Read char #8 RC=1 (58) waited/max        7/4000000  uS 
answer:  00 06 3f 9c 85 a1 31 58 
received 8 characters
CRC receive OK 5831
Transmission State Check: 0
szCvrtFloat     1.222828 0x3f9c85a1
value         1.222828

Elapsed time since last comm 126 us
Attempt 1
Clearing read buffer Success!
szSerBufferSave OK! 03 3b 03 00 00 00 00 00 00 00 
command: 03 3b 03 00 00 00 00 00 16 a5 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=0 (00) waited/max   407154/4000000  uS 
answer:  Got -1 characters

Elapsed time since last comm 0 us
Attempt 2
Clearing read buffer Success!
szSerBufferSave OK! 03 3b 03 00 00 00 00 00 00 00 
command: 03 3b 03 00 00 00 00 00 16 a5 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=0 (00) 
answer:  Got -1 characters

Elapsed time since last comm 0 us
Attempt 3
Clearing read buffer Success!
szSerBufferSave OK! 03 3b 03 00 00 00 00 00 00 00 
command: 03 3b 03 00 00 00 00 00 16 a5 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=0 (00) waited/max   408034/4000000  uS 
answer:  Got -1 characters
_ERROR_ (59 3)

Restoring Serial Port settings /dev/ttyUSB0... Success!
Flushing serial device buffer... Success!
Closing Serial Port /dev/ttyUSB0... Success!

devLCKfile: </var/lock/LCK..ttyUSB0>
devLCKfileNew: </var/lock/LCK..ttyUSB0.20094>
Clearing Serial Port Lock (20094)... done.

20200225-09:29:06: aurora: ERROR: Received bad return code (-1 59 3)

Complete 20200225-09:29:06

