
aurora -b -a 3 -c -T -Y6 -l5 -d0 -e /dev/ttyUSB0 

szttyDevice: /dev/ttyUSB0
yDelay:     5
yTimeout    0 mS
yMaxRunTime ~
devLCKfile: </var/lock/LCK..ttyUSB0>
devLCKfileNew: </var/lock/LCK..ttyUSB0.31285>
Got Params

RunTime     20200226-06:38:17 v1.9.3 
Endian    : Little
tm_gmtoff : yes
PID       : 31285

Attempting to get lock on Serial Port /dev/ttyUSB0...
Checking for lock
PID: 31285 COMMAND: "aurora" LckPID: 31285 LckCOMMAND: "aurora" LckPIDcommand "aurora" = me
Appears we got the lock.

Opening Serial Port /dev/ttyUSB0...  Serial Port /dev/ttyUSB0 successfully opened.
Configuring serial device... Flushing unread data first...  Success!
Flushing serial device buffer... Success!

Comm Check: Let's see if the Aurora is listening... 
Elapsed time since last comm 0 us
Attempt 1
Clearing read buffer Success!
szSerBufferSave OK! 03 3a 00 00 00 00 00 00 00 00 
command: 03 3a 00 00 00 00 00 00 be 36 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=0 (00) waited/max   507210/5000000  uS 
answer:  Got -1 characters

Elapsed time since last comm 0 us
Attempt 2
Clearing read buffer Success!
szSerBufferSave OK! 03 3a 00 00 00 00 00 00 00 00 
command: 03 3a 00 00 00 00 00 00 be 36 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=0 (00) 
answer:  Got -1 characters

Elapsed time since last comm 0 us
Attempt 3
Clearing read buffer Success!
szSerBufferSave OK! 03 3a 00 00 00 00 00 00 00 00 
command: 03 3a 00 00 00 00 00 00 be 36 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=0 (00) 
answer:  Got -1 characters

Elapsed time since last comm 0 us
Attempt 4
Clearing read buffer Success!
szSerBufferSave OK! 03 3a 00 00 00 00 00 00 00 00 
command: 03 3a 00 00 00 00 00 00 be 36 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=1 (00) waited/max    38564/5000000  uS 
Read char #2 RC=1 (00) waited/max       10/5000000  uS 
Read char #3 RC=1 (33) waited/max        7/5000000  uS 
Read char #4 RC=1 (55) waited/max        7/5000000  uS 
Read char #5 RC=1 (4e) waited/max        7/5000000  uS 
Read char #6 RC=1 (4e) waited/max        6/5000000  uS 
Read char #7 RC=1 (e2) waited/max        7/5000000  uS 
Read char #8 RC=1 (53) waited/max        6/5000000  uS 
answer:  00 00 33 55 4e 4e e2 53 
received 8 characters
CRC receive OK 53e2
Transmission State Check: 0
Model ID "3" qMultiplier -1.0000000 -- PVI-3.6-OUTD --
Comm Check: OK

Elapsed time since last comm 233 us
Attempt 1
Clearing read buffer Success!
szSerBufferSave OK! 03 3b 04 00 00 00 00 00 00 00 
command: 03 3b 04 00 00 00 00 00 c7 b9 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=1 (00) waited/max   139579/5000000  uS 
Read char #2 RC=1 (00) waited/max        8/5000000  uS 
Read char #3 RC=1 (00) waited/max        6/5000000  uS 
Read char #4 RC=1 (00) waited/max        7/5000000  uS 
Read char #5 RC=1 (00) waited/max        7/5000000  uS 
Read char #6 RC=1 (00) waited/max        6/5000000  uS 
Read char #7 RC=1 (8f) waited/max        7/5000000  uS 
Read char #8 RC=1 (f7) waited/max        7/5000000  uS 
answer:  00 00 00 00 00 00 8f f7 
received 8 characters
CRC receive OK f78f
Transmission State Check: 0
szCvrtFloat     0.000000 0x00000000
value         0.000000

Elapsed time since last comm 72 us
Attempt 1
Clearing read buffer Success!
szSerBufferSave OK! 03 3b 01 00 00 00 00 00 00 00 
command: 03 3b 01 00 00 00 00 00 40 ad 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=1 (00) waited/max    10049/5000000  uS 
Read char #2 RC=1 (00) waited/max        7/5000000  uS 
Read char #3 RC=1 (00) waited/max        6/5000000  uS 
Read char #4 RC=1 (00) waited/max        6/5000000  uS 
Read char #5 RC=1 (00) waited/max        6/5000000  uS 
Read char #6 RC=1 (00) waited/max        6/5000000  uS 
Read char #7 RC=1 (8f) waited/max        7/5000000  uS 
Read char #8 RC=1 (f7) waited/max        7/5000000  uS 
answer:  00 00 00 00 00 00 8f f7 
received 8 characters
CRC receive OK f78f
Transmission State Check: 0
szCvrtFloat     0.000000 0x00000000
value         0.000000

Elapsed time since last comm 68 us
Attempt 1
Clearing read buffer Success!
szSerBufferSave OK! 03 3b 02 00 00 00 00 00 00 00 
command: 03 3b 02 00 00 00 00 00 3d a1 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=0 (00) waited/max   507976/5000000  uS 
answer:  Got -1 characters

Elapsed time since last comm 0 us
Attempt 2
Clearing read buffer Success!
szSerBufferSave OK! 03 3b 02 00 00 00 00 00 00 00 
command: 03 3b 02 00 00 00 00 00 3d a1 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=1 (00) waited/max    10928/5000000  uS 
Read char #2 RC=1 (00) waited/max        8/5000000  uS 
Read char #3 RC=1 (3f) waited/max        7/5000000  uS 
Read char #4 RC=1 (44) waited/max        7/5000000  uS 
Read char #5 RC=1 (a5) waited/max        7/5000000  uS 
Read char #6 RC=1 (68) waited/max        6/5000000  uS 
Read char #7 RC=1 (9a) waited/max        6/5000000  uS 
Read char #8 RC=1 (52) waited/max        7/5000000  uS 
answer:  00 00 3f 44 a5 68 9a 52 
received 8 characters
CRC receive OK 529a
Transmission State Check: 0
szCvrtFloat     0.768149 0x3f44a568
value         0.768149

Elapsed time since last comm 74 us
Attempt 1
Clearing read buffer Success!
szSerBufferSave OK! 03 3b 03 00 00 00 00 00 00 00 
command: 03 3b 03 00 00 00 00 00 16 a5 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=1 (f7) waited/max    13357/5000000  uS 
Read char #2 RC=0 (00) 
answer:  Got -1 characters

Elapsed time since last comm 0 us
Attempt 2
Clearing read buffer Success!
szSerBufferSave OK! 03 3b 03 00 00 00 00 00 00 00 
command: 03 3b 03 00 00 00 00 00 16 a5 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=0 (00) waited/max   507362/5000000  uS 
answer:  Got -1 characters

Elapsed time since last comm 0 us
Attempt 3
Clearing read buffer Success!
szSerBufferSave OK! 03 3b 03 00 00 00 00 00 00 00 
command: 03 3b 03 00 00 00 00 00 16 a5 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=1 (00) waited/max    14035/5000000  uS 
Read char #2 RC=1 (01) waited/max        7/5000000  uS 
Read char #3 RC=1 (00) waited/max        7/5000000  uS 
Read char #4 RC=1 (00) waited/max        7/5000000  uS 
Read char #5 RC=1 (00) waited/max        7/5000000  uS 
Read char #6 RC=1 (00) waited/max        6/5000000  uS 
Read char #7 RC=1 (cb) waited/max        7/5000000  uS 
Read char #8 RC=1 (fc) waited/max        7/5000000  uS 
answer:  00 01 00 00 00 00 cb fc 
received 8 characters
CRC receive OK fccb
Transmission State Check: 0
szCvrtFloat     0.000000 0x00000000
value         0.000000

Elapsed time since last comm 75 us
Attempt 1
Clearing read buffer Success!
szSerBufferSave OK! 03 3b 17 00 00 00 00 00 00 00 
command: 03 3b 17 00 00 00 00 00 0a f7 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=1 (00) waited/max      526/5000000  uS 
Read char #2 RC=1 (01) waited/max        7/5000000  uS 
Read char #3 RC=1 (42) waited/max        7/5000000  uS 
Read char #4 RC=1 (bb) waited/max        7/5000000  uS 
Read char #5 RC=1 (33) waited/max        7/5000000  uS 
Read char #6 RC=1 (97) waited/max        7/5000000  uS 
Read char #7 RC=1 (12) waited/max        7/5000000  uS 
Read char #8 RC=1 (0c) waited/max        7/5000000  uS 
answer:  00 01 42 bb 33 97 12 0c 
received 8 characters
CRC receive OK 0c12
Transmission State Check: 0
szCvrtFloat    93.600761 0x42bb3397
value        93.600761

Elapsed time since last comm 77 us
Attempt 1
Clearing read buffer Success!
szSerBufferSave OK! 03 3b 19 00 00 00 00 00 00 00 
command: 03 3b 19 00 00 00 00 00 a8 ce 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=0 (00) 
answer:  Got -1 characters

Elapsed time since last comm 0 us
Attempt 2
Clearing read buffer Success!
szSerBufferSave OK! 03 3b 19 00 00 00 00 00 00 00 
command: 03 3b 19 00 00 00 00 00 a8 ce 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=0 (00) 
answer:  Got -1 characters

Elapsed time since last comm 0 us
Attempt 3
Clearing read buffer Success!
szSerBufferSave OK! 03 3b 19 00 00 00 00 00 00 00 
command: 03 3b 19 00 00 00 00 00 a8 ce 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=0 (00) waited/max   507635/5000000  uS 
answer:  Got -1 characters

Elapsed time since last comm 0 us
Attempt 4
Clearing read buffer Success!
szSerBufferSave OK! 03 3b 19 00 00 00 00 00 00 00 
command: 03 3b 19 00 00 00 00 00 a8 ce 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=0 (00) 
answer:  Got -1 characters

Elapsed time since last comm 0 us
Attempt 5
Clearing read buffer Success!
szSerBufferSave OK! 03 3b 19 00 00 00 00 00 00 00 
command: 03 3b 19 00 00 00 00 00 a8 ce 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=0 (00) waited/max   508504/5000000  uS 
answer:  Got -1 characters

Elapsed time since last comm 0 us
Attempt 6
Clearing read buffer Success!
szSerBufferSave OK! 03 3b 19 00 00 00 00 00 00 00 
command: 03 3b 19 00 00 00 00 00 a8 ce 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=0 (00) 
answer:  Got -1 characters
_ERROR_ (59 25)

Restoring Serial Port settings /dev/ttyUSB0... Success!
Flushing serial device buffer... Success!
Closing Serial Port /dev/ttyUSB0... Success!

devLCKfile: </var/lock/LCK..ttyUSB0>
devLCKfileNew: </var/lock/LCK..ttyUSB0.31285>
Clearing Serial Port Lock (31285)... done.

20200226-06:38:24: aurora: ERROR: Received bad return code (-1 59 25)

Complete 20200226-06:38:24

