
aurora -b -a 3 -c -T -Y3 -l4 -d0 -e /dev/ttyUSB0 

szttyDevice: /dev/ttyUSB0
yDelay:     4
yTimeout    0 mS
yMaxRunTime ~
devLCKfile: </var/lock/LCK..ttyUSB0>
devLCKfileNew: </var/lock/LCK..ttyUSB0.20076>
Got Params

RunTime     20200225-09:28:35 v1.9.3 
Endian    : Little
tm_gmtoff : yes
PID       : 20076

Attempting to get lock on Serial Port /dev/ttyUSB0...
Checking for lock
PID: 20076 COMMAND: "aurora" LckPID: 20076 LckCOMMAND: "aurora" LckPIDcommand "aurora" = me
Appears we got the lock.

Opening Serial Port /dev/ttyUSB0...  Serial Port /dev/ttyUSB0 successfully opened.
Configuring serial device... Flushing unread data first...  Success!
Flushing serial device buffer... Success!

Comm Check: Let's see if the Aurora is listening... 
Elapsed time since last comm 0 us
Attempt 1
Clearing read buffer Success!
szSerBufferSave OK! 03 3a 00 00 00 00 00 00 00 00 
command: 03 3a 00 00 00 00 00 00 be 36 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=0 (00) 
answer:  Got -1 characters

Elapsed time since last comm 0 us
Attempt 2
Clearing read buffer Success!
szSerBufferSave OK! 03 3a 00 00 00 00 00 00 00 00 
command: 03 3a 00 00 00 00 00 00 be 36 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=1 (00) waited/max     1919/4000000  uS 
Read char #2 RC=1 (06) waited/max        7/4000000  uS 
Read char #3 RC=1 (33) waited/max        7/4000000  uS 
Read char #4 RC=1 (55) waited/max        7/4000000  uS 
Read char #5 RC=1 (4e) waited/max        7/4000000  uS 
Read char #6 RC=1 (4e) waited/max        7/4000000  uS 
Read char #7 RC=1 (7a) waited/max        6/4000000  uS 
Read char #8 RC=1 (68) waited/max        7/4000000  uS 
answer:  00 06 33 55 4e 4e 7a 68 
received 8 characters
CRC receive OK 687a
Transmission State Check: 0
Model ID "3" qMultiplier -1.0000000 -- PVI-3.6-OUTD --
Comm Check: OK

Elapsed time since last comm 217 us
Attempt 1
Clearing read buffer Success!
szSerBufferSave OK! 03 3b 04 00 00 00 00 00 00 00 
command: 03 3b 04 00 00 00 00 00 c7 b9 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=0 (00) waited/max   407464/4000000  uS 
answer:  Got -1 characters

Elapsed time since last comm 0 us
Attempt 2
Clearing read buffer Success!
szSerBufferSave OK! 03 3b 04 00 00 00 00 00 00 00 
command: 03 3b 04 00 00 00 00 00 c7 b9 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=0 (00) waited/max   407919/4000000  uS 
answer:  Got -1 characters

Elapsed time since last comm 0 us
Attempt 3
Clearing read buffer Success!
szSerBufferSave OK! 03 3b 04 00 00 00 00 00 00 00 
command: 03 3b 04 00 00 00 00 00 c7 b9 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=1 (00) waited/max     1151/4000000  uS 
Read char #2 RC=1 (06) waited/max        7/4000000  uS 
Read char #3 RC=1 (42) waited/max    15836/4000000  uS 
Read char #4 RC=1 (48) waited/max        7/4000000  uS 
Read char #5 RC=1 (14) waited/max        7/4000000  uS 
Read char #6 RC=1 (7d) waited/max        7/4000000  uS 
Read char #7 RC=1 (f1) waited/max        7/4000000  uS 
Read char #8 RC=1 (79) waited/max        6/4000000  uS 
answer:  00 06 42 48 14 7d f1 79 
received 8 characters
CRC receive OK 79f1
Transmission State Check: 0
szCvrtFloat    50.020008 0x4248147d
value        50.020008

Elapsed time since last comm 82 us
Attempt 1
Clearing read buffer Success!
szSerBufferSave OK! 03 3b 01 00 00 00 00 00 00 00 
command: 03 3b 01 00 00 00 00 00 40 ad 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=0 (00) waited/max   408876/4000000  uS 
answer:  Got -1 characters

Elapsed time since last comm 0 us
Attempt 2
Clearing read buffer Success!
szSerBufferSave OK! 03 3b 01 00 00 00 00 00 00 00 
command: 03 3b 01 00 00 00 00 00 40 ad 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=0 (00) waited/max   407508/4000000  uS 
answer:  Got -1 characters

Elapsed time since last comm 0 us
Attempt 3
Clearing read buffer Success!
szSerBufferSave OK! 03 3b 01 00 00 00 00 00 00 00 
command: 03 3b 01 00 00 00 00 00 40 ad 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=0 (00) 
answer:  Got -1 characters
_ERROR_ (59 1)

Restoring Serial Port settings /dev/ttyUSB0... Success!
Flushing serial device buffer... Success!
Closing Serial Port /dev/ttyUSB0... Success!

devLCKfile: </var/lock/LCK..ttyUSB0>
devLCKfileNew: </var/lock/LCK..ttyUSB0.20076>
Clearing Serial Port Lock (20076)... done.

20200225-09:28:38: aurora: ERROR: Received bad return code (-1 59 1)

Complete 20200225-09:28:38

