
aurora -b -a 3 -c -T -Y6 -l5 -d0 -e /dev/ttyUSB0 

szttyDevice: /dev/ttyUSB0
yDelay:     5
yTimeout    0 mS
yMaxRunTime ~
devLCKfile: </var/lock/LCK..ttyUSB0>
devLCKfileNew: </var/lock/LCK..ttyUSB0.31228>
Got Params

RunTime     20200226-06:37:20 v1.9.3 
Endian    : Little
tm_gmtoff : yes
PID       : 31228

Attempting to get lock on Serial Port /dev/ttyUSB0...
Checking for lock
PID: 31228 COMMAND: "aurora" LckPID: 31228 LckCOMMAND: "aurora" LckPIDcommand "aurora" = me
Appears we got the lock.

Opening Serial Port /dev/ttyUSB0...  Serial Port /dev/ttyUSB0 successfully opened.
Configuring serial device... Flushing unread data first...  Success!
Flushing serial device buffer... Success!

Comm Check: Let's see if the Aurora is listening... 
Elapsed time since last comm 0 us
Attempt 1
Clearing read buffer Success!
szSerBufferSave OK! 03 3a 00 00 00 00 00 00 00 00 
command: 03 3a 00 00 00 00 00 00 be 36 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=0 (00) waited/max   508363/5000000  uS 
answer:  Got -1 characters

Elapsed time since last comm 0 us
Attempt 2
Clearing read buffer Success!
szSerBufferSave OK! 03 3a 00 00 00 00 00 00 00 00 
command: 03 3a 00 00 00 00 00 00 be 36 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=0 (00) 
answer:  Got -1 characters

Elapsed time since last comm 0 us
Attempt 3
Clearing read buffer Success!
szSerBufferSave OK! 03 3a 00 00 00 00 00 00 00 00 
command: 03 3a 00 00 00 00 00 00 be 36 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=1 (00) waited/max    42483/5000000  uS 
Read char #2 RC=1 (00) waited/max        8/5000000  uS 
Read char #3 RC=1 (33) waited/max        7/5000000  uS 
Read char #4 RC=1 (55) waited/max        7/5000000  uS 
Read char #5 RC=1 (4e) waited/max        7/5000000  uS 
Read char #6 RC=1 (4e) waited/max        7/5000000  uS 
Read char #7 RC=1 (e2) waited/max        6/5000000  uS 
Read char #8 RC=1 (53) waited/max        7/5000000  uS 
answer:  00 00 33 55 4e 4e e2 53 
received 8 characters
CRC receive OK 53e2
Transmission State Check: 0
Model ID "3" qMultiplier -1.0000000 -- PVI-3.6-OUTD --
Comm Check: OK

Elapsed time since last comm 222 us
Attempt 1
Clearing read buffer Success!
szSerBufferSave OK! 03 3b 04 00 00 00 00 00 00 00 
command: 03 3b 04 00 00 00 00 00 c7 b9 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=0 (00) 
answer:  Got -1 characters

Elapsed time since last comm 0 us
Attempt 2
Clearing read buffer Success!
szSerBufferSave OK! 03 3b 04 00 00 00 00 00 00 00 
command: 03 3b 04 00 00 00 00 00 c7 b9 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=0 (00) waited/max   508158/5000000  uS 
answer:  Got -1 characters

Elapsed time since last comm 0 us
Attempt 3
Clearing read buffer Success!
szSerBufferSave OK! 03 3b 04 00 00 00 00 00 00 00 
command: 03 3b 04 00 00 00 00 00 c7 b9 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=0 (00) 
answer:  Got -1 characters

Elapsed time since last comm 0 us
Attempt 4
Clearing read buffer Success!
szSerBufferSave OK! 03 3b 04 00 00 00 00 00 00 00 
command: 03 3b 04 00 00 00 00 00 c7 b9 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=0 (00) waited/max   509024/5000000  uS 
answer:  Got -1 characters

Elapsed time since last comm 0 us
Attempt 5
Clearing read buffer Success!
szSerBufferSave OK! 03 3b 04 00 00 00 00 00 00 00 
command: 03 3b 04 00 00 00 00 00 c7 b9 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=0 (00) 
answer:  Got -1 characters

Elapsed time since last comm 0 us
Attempt 6
Clearing read buffer Success!
szSerBufferSave OK! 03 3b 04 00 00 00 00 00 00 00 
command: 03 3b 04 00 00 00 00 00 c7 b9 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=0 (00) waited/max   507886/5000000  uS 
answer:  Got -1 characters
_ERROR_ (59 4)

Restoring Serial Port settings /dev/ttyUSB0... Success!
Flushing serial device buffer... Success!
Closing Serial Port /dev/ttyUSB0... Success!

devLCKfile: </var/lock/LCK..ttyUSB0>
devLCKfileNew: </var/lock/LCK..ttyUSB0.31228>
Clearing Serial Port Lock (31228)... done.

20200226-06:37:24: aurora: ERROR: Received bad return code (-1 59 4)

Complete 20200226-06:37:24

