
aurora -b -a 2 -c -T -Y6 -l5 -d0 -e /dev/ttyUSB0 

szttyDevice: /dev/ttyUSB0
yDelay:     5
yTimeout    0 mS
yMaxRunTime ~
devLCKfile: </var/lock/LCK..ttyUSB0>
devLCKfileNew: </var/lock/LCK..ttyUSB0.8975>
Got Params

RunTime     20200227-06:38:33 v1.9.3 
Endian    : Little
tm_gmtoff : yes
PID       : 8975

Attempting to get lock on Serial Port /dev/ttyUSB0...
Checking for lock
PID: 8975 COMMAND: "aurora" LckPID: 8975 LckCOMMAND: "aurora" LckPIDcommand "aurora" = me
Appears we got the lock.

Opening Serial Port /dev/ttyUSB0...  Serial Port /dev/ttyUSB0 successfully opened.
Configuring serial device... Flushing unread data first...  Success!
Flushing serial device buffer... Success!

Comm Check: Let's see if the Aurora is listening... 
Elapsed time since last comm 0 us
Attempt 1
Clearing read buffer Success!
szSerBufferSave OK! 02 3a 00 00 00 00 00 00 00 00 
command: 02 3a 00 00 00 00 00 00 01 b7 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=0 (00) waited/max   508813/5000000  uS 
answer:  Got -1 characters

Elapsed time since last comm 0 us
Attempt 2
Clearing read buffer Success!
szSerBufferSave OK! 02 3a 00 00 00 00 00 00 00 00 
command: 02 3a 00 00 00 00 00 00 01 b7 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=0 (00) waited/max   507245/5000000  uS 
answer:  Got -1 characters

Elapsed time since last comm 0 us
Attempt 3
Clearing read buffer Success!
szSerBufferSave OK! 02 3a 00 00 00 00 00 00 00 00 
command: 02 3a 00 00 00 00 00 00 01 b7 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=0 (00) 
answer:  Got -1 characters

Elapsed time since last comm 0 us
Attempt 4
Clearing read buffer Success!
szSerBufferSave OK! 02 3a 00 00 00 00 00 00 00 00 
command: 02 3a 00 00 00 00 00 00 01 b7 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=0 (00) waited/max   508105/5000000  uS 
answer:  Got -1 characters

Elapsed time since last comm 0 us
Attempt 5
Clearing read buffer Success!
szSerBufferSave OK! 02 3a 00 00 00 00 00 00 00 00 
command: 02 3a 00 00 00 00 00 00 01 b7 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=0 (00) 
answer:  Got -1 characters

Elapsed time since last comm 0 us
Attempt 6
Clearing read buffer Success!
szSerBufferSave OK! 02 3a 00 00 00 00 00 00 00 00 
command: 02 3a 00 00 00 00 00 00 01 b7 
Flushing serial device buffer... Success!
Sending command... sent 10 characters
Draining serial device buffer... Success!
Cleared data buffer: 00 00 00 00 00 00 00 00 00 00 
Read char #1 RC=0 (00) waited/max   508976/5000000  uS 
answer:  Got -1 characters
Comm Check: Failure, aborting...

Restoring Serial Port settings /dev/ttyUSB0... Success!
Flushing serial device buffer... Success!
Closing Serial Port /dev/ttyUSB0... Success!

devLCKfile: </var/lock/LCK..ttyUSB0>
devLCKfileNew: </var/lock/LCK..ttyUSB0.8975>
Clearing Serial Port Lock (8975)... done.

20200227-06:38:36: aurora: ERROR: Received bad return code (-1 0)

Complete 20200227-06:38:36

